from langchain_core.tools import tool


@tool("avrora_info_tool")
def avrora_info_tool(topic: str) -> str:
    """
    Цей інструмент повертає інформацію про компанію "Аврора". Залежно від теми (topic), повертається різна інформація. Ось можливі теми:
    numbers - цифрова інформація про компанію така як кількість магазинів, сума сплачених податків, благодійність та інше.
    clients - інформація про відносини з покупцями, замовниками, їх відгуки
    contacts - інформація про контактні дані, номер телефона, адреси електронної пошти
    help - інформація про допомогу у разі порушення норм, контакти лінії довіри
    values - інформація про цінності і пріоритети компанії
    work - інформація про роботу, переваги для працівників
    ecology - інформація про захист навколишнього середовища, еколошія тощо
    war - інформація про допомогу і підтримку постраждалих від війни та бойових дій

    """

    if topic == "numbers":
        info = """
    **Аврора в цифрах**  
1600+ Магазинів Аврора по Україні  
6,4 млрд Гривень сплачених податків і зборів (за 2024 р.)  
498 млн Гривень на благодійну допомогу (з 24.02.2022 р.)  
2800+ Звернень про благодійну допомогу опрацьовано  
765 000+ Видано одиниць товару гуманітарної допомоги  
70% Частка вітчизняних постачальників """

    if topic == "clients":
        info = """**Аврора – це турбота про клієнтів**  
Аврора підтримує український бізнес. Значна кількість товарів на сайті вітчизняного виробництва. Інтернет-магазин регулярно поповнюється новинками і розширює асортимент. Кожен знайде на сайті корисні та потрібні речі. Магазин гарантує якість і в разі необхідності готовий обміняти товар.  
Для оптових замовників інтернет-магазин Аврора пропонує вигідні та зручні умови співробітництва:  
Формуємо замовлення кожного клієнта окремо, відштовхуючись від його потреб та фінансових можливостей  
Завжди пропонуємо конкурентну ціну  
У разі необхідності знаходимо рівноцінні варіанти для клієнтів  
За відгуками покупців, Аврора – саме той магазин, в якому швидко можна наповнити кошик, зекономити сімейний бюджет і при цьому отримати тільки позитивні емоції.  
Обирай Аврору та занурюйся у світ цікавих речей. Переходь на сторінки за омріяним товаром вже зараз!
        """

    if topic == "contacts":
        info = """
        З’явилися додаткові питання?
Ми можемо тобі допомогти
0 (800) 30 00 66 безкоштовно
info@avrora.ua
pr@avrora.ua
        """

    if topic == "help":
        info = """**Лінія довіри**  
Лінія довіри – це наш спосіб зробити ваш голос почутим. Якщо ви зіткнулися з недоброчесними діями або порушенням наших цінностей – зв’яжіться з нами у зручний для вас спосіб. Ми гарантуємо конфіденційність кожного звернення.  
help@avrora.ua  
0 800 308 988  
+38(067) 926 24 26 Лінія "Довіряй впевнено"  
(Дзвінки/Telegram/Viber)
        """

    if topic == "values":
        info = """**Цінності**  
У повсякденному житті їх дотримуватись буває складно, але ми стараємось, бо знаємо, що без них було б ще складніше  
#лідируй_в_ефективності  
Наш успіх ґрунтується на контролі витрат та правильному Використанні ресурсів. Ми надаємо низькі ціни та додаткові переваги клієнту, за які він обирає Аврору.  
#створюй_свій_світ  
Кожна людина має особисті мрії та амбіції. У Аврорі ми досягаємо своїх особистих мрій, навіть коли допомагаємо іншим. Ми віримо, що навіть маленька ідея може бути початком чогось великого і реального.  
#будь_відкритим_до_нового  
Ми - гнучка команда, яка завжди знаходить нестандартні рішення і нові можливості, щоб з кожним наступним днем ставати кращими. Відкритість до змін це наші двері у майбутнє.  
#візьми_відповідальність_отримай_можливість  
Взяти відповідальність це бажання зробити більше і краще, бо хочеться особливих досягнень. Ми створюємо у Аврорі справедливе середовище і отримуємо можливості для росту та розвитку.  
#взаємодій_заради_мрій  
Єдність є нашою основною силою, бо успіх справа не однієї людини. У Аврорі таке середовище, що кожен почутий і це усвідомлення допомагає служити клієнтам та будувати довіру.  
#даруй_добро_вільно  
У нас добрі серця, які здатні дарувати любов, не очікуючи нічого натомість.
        """

    if topic == "work":
        info = """
        **Добробут працівників**  
Наша компанія дбає про добробут наших працівників, створюючи комфортні умови для роботи, розвитку і відпочинку. Підтримуємо баланс між професійним і особистим життям, забезпечуючи здоров'я, безпеку, фізичне і ментальне благополуччя кожного члена нашої команди.  
**Переваги, які ти маєш, працюючи у “Аврора”**  
Офіційне працевлаштування згідно КЗпП з першого робочого дня  
Можливість швидко збудувати горизонтальну та вертикальну кар’єру  
Компанія сплачує всі податки за своїх співробітників  
Безкоштовна юридична консультація  
Знижка 15% на покупки товарів в нашій мережі  
Baby box для новонароджених аврорчиків  
Щотижневі онлайн збори всієї компанії із можливістю задати питання генеральному директору  
Можливість вивчати англійську мову з частковою або повною компенсацією вартості  
Безкоштовні курси і тренінги від корпоративного навчального центру  
Можливість навчатись на будь-яких зовнішніх платформах з частковою або повною компенсацією вартості  
Унікальна корпоративна культура, цікаві івенти та заходи  
Неймовірне спортивне ком’юніті з регулярними челенджами та призами  
Можливість ініціювати та долучатись до благодійних проєктів  
Матеріальна допомога від Аврори для ВПО та людей з інвалідністю  
Премія за рекомендацію знайомих на роботу в Аврору  
Можливість долучитись до корпоративного донорства в Аврорі
        """

    if topic == "ecology":
        info = """
        **Охорона навколишнього середовища**  
"Аврора" активно підтримує ініціативи з охорони навколишнього середовища, впроваджуючи екопрактики у своїй діяльності. Ми прагнемо зменшити свій екологічний слід, впроваджуючи стійкі рішення, підтримуючи проєкти з відновлення природних екосистем та активно залучаючи наших співробітників до заходів з охорони природи.
        """

    if topic == "war":
        info = """
        **Підтримка Сил оборони та постраждалих від війни**  
"Аврора" активно підтримує Збройні Сили України та постраждалих від війни, надаючи фінансову допомогу, гуманітарну підтримку та участь у волонтерських ініціативах. Ми віримо у важливість єднання зусиль для захисту нашої країни та допомоги тим, хто найбільше цього потребує.
        """
    return info
