from os.path import split
from langchain_core.tools import tool
import yaml


@tool("holiday_info_tool")
def holiday_info_tool(key: str) -> str:
    """
    Цей інструмент повертає список категорій подарунків, які підходять на певні свята.
    Ось можливі свята: Baby Shower, Благодійний захід, Великдень, Весняне прибирання, Весілля, Вечір креативності, Вечір кіно вдома, Вечір настільних ігор, Вечір спогадів, Вечір читання, Випускний, Відпустка, День Землі, День Святого Валентина, День бабусі, День бабусі й дідуся, День батька, День вдячності, День весни, День вина, День вишиванки, День волонтера, День відкриття бізнесу, День відкриття магазину, День гарбуза, День гумору, День домашнього затишку, День домашнього улюбленця, День друзів, День дідуся, День дітей, День еколога, День закоханих, День здоров'я, День зимових свят, День знань, День книги, День кохання, День кухаря, День кіно, День матері, День миру, День молоді, День музики, День народження, День народження домашнього улюбленця, День настільних ігор, День незалежності, День нових починань, День осіннього листя, День переїзду, День першого побачення, День першого снігу ітд.
    """
    yaml_file = '../Data/recommendations.yaml'

    with open(yaml_file, 'r', encoding='utf-8') as file:
        data = yaml.safe_load(file)

    available_keys = ", ".join(data.keys())

    if key in data:
        return f"Information for '{key}': {data[key]}"
    else:
        return f"Error: '{key}' is not a valid holiday. Available holidays are: {available_keys}"
