from langchain_core.tools import tool


@tool("holiday_info_tool")
def holiday_info_tool(holiday: str) -> str:
    """
    Цей інструмент повертає інформацію про свята і події та товари, які їм відповідають. Залежно від назви свята (holiday), повертається різна інформація.
    """

    if holiday == "День народження":
        info = """
        Папір для подарунків
Свічки
Вітальні листівки
Фоторамки
Подарункові пакети
Плюшеві іграшки
Ковпаки для вечірки
Гірлянди
Набори кульок
Декоративні лампочки
        """

    if holiday == "Новий рік":
        info = """
            Ялинкові прикраси
Гірлянди
Снігові кулі
Подарункові коробки
Новорічні чашки
Тематичні серветки
Новорічні шкарпетки
Свічки на батарейках
Святкові сервірувальні прикраси
Новорічні вінки

            """

    if holiday == "День знань":
        info = """
Зошити
Ручки
Рюкзаки
Ланчбокси
Пенали
Лінійки
Стікери
Маркери
Папки
Обкладинки для книг

            """

    if holiday == "Весілля":
        info = """
Фотоальбоми
Фужери для шампанського
Гостьові книги
Весільні сувеніри
Декоративні свічки
Фігурки для торта
Пелюстки квітів
Тримачі для кілець
Конфеті
Тематичні скатертини
            """

    if holiday == "Baby Shower":
        info = """
Одяг для немовлят
М'які іграшки
Ковдри для дітей
Фоторамки для дитячих фото
Подарункові коробки
Іграшки для прорізування зубів
Слинявчики
Дитячі пляшечки
Декор для кімнати
Музичні іграшки

            """

    if holiday == "Випускний":
        info = """
Фотоальбоми
Трофеї
Подарункові сертифікати
Мотиваційні плакати
Декоративні предмети
Вітальні банери
Ручки
Планери
Зошити
Обрамлені сертифікати
            """

    if holiday == "Різдво":
        info = """
Святкові чашки
Подарункові пакети
Тематичні прикраси
Свічки
Шкарпетки для подарунків
Святкові гірлянди
Снігові кулі
Декор для столу
Святкові рушники
Подарункові набори

            """

    if holiday == "Хелловін":
        info = """
Маски
Гарбузові декорації
Гірлянди
Свічки
Тематичні наклейки
Штучна павутина
Костюми
Сумки для солодощів
Ліхтарики
Гарбузові фігурки
            """

    if holiday == "День Святого Валентина":
        info = """
Валентинки
Плюшеві іграшки
Свічки
Шоколадні набори
Рамки для фото
Квіткові вази
Подушки-серця
Ароматичні масла
Кулони або браслети
Подарункові коробки
            """

    if holiday == "Великдень":
        info = """
Декоративні яйця
Кошики
Наклейки для яєць
Тканинні серветки
Фігурки зайчиків
Форми для випічки
Вітальні листівки
Папір для випічки
Святкові рушники
Свічки

            """

    if holiday == "День матері":
        info = """
Квіткові вази
Декоративні свічки
Тематичні листівки
Кухонний текстиль
Шоколадні набори
Ароматичні свічки
Подушки для відпочинку
Подарункові пакети
Набори для чаю або кави
Ароматизатори для дому
            """

    if holiday == "День батька":
        info = """
Кружки з написами
Ремені
Гаманці
Набори інструментів
Фляги
Спортивні пляшки для води
Тематичні футболки
Декоративні рамки
Брелоки
Подарункові коробки
            """

    if holiday == "Ювілей":
        info = """
Пам’ятні фотоальбоми
Гравіровані келихи
Святкові банери
Свічки
Фоторамки
Подарункові коробки
Набори декору для столу
Серветки із тематичними візерунками
Декоративні стрічки
Тематичні листівки
            """

    if holiday == "Річниця весілля":
        info = """
Келихи для шампанського
Декоративні свічки
Рамки для спільних фото
М'які подушки у формі серця
Ковдри
Шоколадні набори
Вази для квітів
Подарункові сертифікати
Набори ароматичних свічок
Листівки з побажаннями
            """



    return info
